Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/edc/PIC32CM5164JH00032.PIC
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="NMIFLAG" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40002802">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="NMI" edc:nzwidth="0x1" edc:desc="Non-Maskable Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x40002803"/>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x40002804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Busy Status"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Synchronization Busy Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="EVCTRL" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40002808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINTEO0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x4000280C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40002810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:nzwidth="0x1" edc:desc="External Interrupt 0 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:nzwidth="0x1" edc:desc="External Interrupt 1 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:nzwidth="0x1" edc:desc="External Interrupt 2 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:nzwidth="0x1" edc:desc="External Interrupt 3 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:nzwidth="0x1" edc:desc="External Interrupt 4 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:nzwidth="0x1" edc:desc="External Interrupt 5 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:nzwidth="0x1" edc:desc="External Interrupt 6 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:nzwidth="0x1" edc:desc="External Interrupt 7 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:nzwidth="0x1" edc:desc="External Interrupt 8 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:nzwidth="0x1" edc:desc="External Interrupt 9 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:nzwidth="0x1" edc:desc="External Interrupt 10 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:nzwidth="0x1" edc:desc="External Interrupt 11 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:nzwidth="0x1" edc:desc="External Interrupt 12 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:nzwidth="0x1" edc:desc="External Interrupt 13 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:nzwidth="0x1" edc:desc="External Interrupt 14 Enable"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:nzwidth="0x1" edc:desc="External Interrupt 15 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40002814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:nzwidth="0x1" edc:desc="External Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:nzwidth="0x1" edc:desc="External Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:nzwidth="0x1" edc:desc="External Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:nzwidth="0x1" edc:desc="External Interrupt 3"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:nzwidth="0x1" edc:desc="External Interrupt 4"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:nzwidth="0x1" edc:desc="External Interrupt 5"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:nzwidth="0x1" edc:desc="External Interrupt 6"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:nzwidth="0x1" edc:desc="External Interrupt 7"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:nzwidth="0x1" edc:desc="External Interrupt 8"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:nzwidth="0x1" edc:desc="External Interrupt 9"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:nzwidth="0x1" edc:desc="External Interrupt 10"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:nzwidth="0x1" edc:desc="External Interrupt 11"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:nzwidth="0x1" edc:desc="External Interrupt 12"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:nzwidth="0x1" edc:desc="External Interrupt 13"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:nzwidth="0x1" edc:desc="External Interrupt 14"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:nzwidth="0x1" edc:desc="External Interrupt 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
