Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/edc/PIC32CM5164JH00032.PIC
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="IMR" edc:nzwidth="0x20" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFFFFF" edc:_addr="0x42006418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition Detected Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End bit Condition Detected Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ISR" edc:nzwidth="0x20" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFFFFF" edc:_addr="0x4200641C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition Detected"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End bit Condition Detected"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Detected"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="UASR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x42006420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="URAT" edc:nzwidth="0x3" edc:desc="Undefined Register Access Trace">
              <edc:SFRFieldSemantic edc:cname="UNSPEC_STRUCT_MEMBER" edc:desc="Unspecified structure member set to one detected when the descriptor is loaded" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CFG_MODIFIED" edc:desc="CFG modified during active monitoring" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DSCR_MODIFIED" edc:desc="DSCR modified during active monitoring" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HASH_MODIFIED" edc:desc="HASH modified during active monitoring" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="READ_ACCESS" edc:desc="Write-only register read access" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x42006424"/>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="DSCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnn------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFC0" edc:_addr="0x42006430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DASA" edc:nzwidth="0x1A" edc:desc="Descriptor Area Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="HASH" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF80" edc:_addr="0x42006434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="HASA" edc:nzwidth="0x19" edc:desc="Hash Area Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="UIHVAL0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42006438">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="UIHVAL1" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200643C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="UIHVAL2" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42006440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="UIHVAL3" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42006444">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="UIHVAL4" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42006448">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="UIHVAL5" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200644C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="UIHVAL6" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42006450">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
